; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	image3 - mode
	image4 - mode
	spectrograph5 - mode
	image1 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph5)
	(supports instrument1 image3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 spectrograph5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument5 thermograph0)
	(supports instrument5 image3)
	(supports instrument5 spectrograph5)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image4)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument7 thermograph0)
	(supports instrument7 image4)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
	(supports instrument8 spectrograph5)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image3)
	(calibration_target instrument9 Star2)
	(supports instrument10 spectrograph5)
	(supports instrument10 image3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
)
(:goal (and
	(pointing satellite2 Star2)
	(pointing satellite4 Planet5)
	(pointing satellite5 Star7)
	(have_image Planet5 spectrograph5)
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Planet8 image1)
	(have_image Planet8 image4)
	(have_image Star9 image4)
	(have_image Star9 spectrograph2)
))

)

; plan
1. (turn_to satellite4 groundstation4 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite4 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite4 planet8 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 planet8)
   goals met: 0 of 10
5. (turn_to satellite0 groundstation1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 10
6. (take_image satellite4 planet8 instrument7 image4)
   added: (have_image planet8 image4)
   goals met: 1 of 10
7. (take_image satellite4 planet8 instrument7 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 10
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
9. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 10
10. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 10
11. (take_image satellite0 phenomenon6 instrument1 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 3 of 10
12. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   goals met: 3 of 10
13. (take_image satellite0 planet5 instrument1 spectrograph5)
   added: (have_image planet5 spectrograph5)
   goals met: 4 of 10
14. (turn_to satellite0 star7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star7)
   goals met: 4 of 10
15. (take_image satellite0 star7 instrument1 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 5 of 10
16. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 5 of 10
17. (take_image satellite0 star9 instrument1 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 6 of 10
18. (turn_to satellite2 star2 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star2)
   goals met: 7 of 10
19. (turn_to satellite4 star9 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star9)
   goals met: 7 of 10
20. (take_image satellite4 star9 instrument7 image4)
   added: (have_image star9 image4)
   goals met: 8 of 10
21. (turn_to satellite4 planet5 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 planet5)
   goals met: 9 of 10
22. (turn_to satellite5 star7 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 star7)
   goals met: 10 of 10
